FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1788/LPC1788_USBDeviceController.c
    // enable EP
    LPC1788_USBDev_EndpointEnable(
            p,
            aIndex);
}

/*-------------------------------------------------------------------------*
 * Function:  USBInitialize
 *-------------------------------------------------------------------------*
 * Description:
 *      Initialize the hardware
 * Inputs:
 *      void *aWorkspace          -- USBDev Controller's workspace
 *-------------------------------------------------------------------------*/
void LPC1788_USBDev_Initialize(void *aWorkspace)
{
    extern void USBSharedInterruptSetup(void);
    TUInt8 i;
    T_LPC1788_USBDev_Workspace *p = (T_LPC1788_USBDev_Workspace *)aWorkspace;

    // Ensure power is on
    LPC1788PowerOn(1UL<<31);

    LPC_USB->OTGClkCtrl = 0x0000001B;
    while ((LPC_USB->OTGClkSt & 0x0000001B) != 0x1B) {
        ;
    }
    LPC_USB->OTGStCtrl = 0x00000003;

    // Setup standard control endpoints
    LPC1788_USBDev_EndpointConfigure(
        aWorkspace,
        0x00,
        USB_ENDPOINT0_PACKET_SIZE);
    LPC1788_USBDev_EndpointConfigure(
        aWorkspace,
        0x80,
        USB_ENDPOINT0_PACKET_SIZE);

    // Only ACKs generate interrupts
//    LPC1788_USBDev_InterruptNakEnable(aWorkspace, 0);
    LPC1788_USBDev_InterruptNakEnable(aWorkspace, USB_DEVICE_SET_MODE_INAK_BI);

    // Setup interrupts for endpoints
    for (i=0; i<MAX_NUM_ENDPOINTS; i++)  {
        if (p->iSettings.iUSBDevice->iEndpointFuncs[i].iIn)
            LPC1788_USBDev_EndpointInterruptsEnable(aWorkspace,
                USB_ENDPOINT_ADDRESS(i, USB_ENDPOINT_ADDRESS_DIR_IN));
        if (p->iSettings.iUSBDevice->iEndpointFuncs[i].iOut)
            LPC1788_USBDev_EndpointInterruptsEnable(aWorkspace,
                USB_ENDPOINT_ADDRESS(i, USB_ENDPOINT_ADDRESS_DIR_OUT));
    }

    USBSharedInterruptSetup();
}

/*-------------------------------------------------------------------------*
 * Function:  LPC1788_USBDev_GetDescriptor
 *-------------------------------------------------------------------------*
 * Description:
 *      Search for a descriptor in the descriptor table based on the
 *      type and the index (of that type).  Return a pointer to the data
 *      and fill in the length of the data.
 * Inputs:
 *      void *aWorkspace          -- USBDev Controller's workspace
 *      TUInt8 aType              -- Type of descriptor to find
 *      TUInt16 aIndex            -- Index to descriptor (zero based)
 *      TUInt16 *aLength          -- Pointer to place to store length
 * Outputs:
 *      TUInt8 *                  -- Pointer to descriptor, or 0 for none.
 *-------------------------------------------------------------------------*/
const TUInt8 *LPC1788_USBDev_GetDescriptor(
            void *aWorkspace,
            TUInt8 aType,
            TUInt16 aIndex,
            TUInt16 *aLength)
{
    const TUInt8 *p = ((T_LPC1788_USBDev_Workspace *)aWorkspace)->
                    iSettings.iUSBDescriptorTable;
    T_USBDescriptorHeader *p_header = (T_USBDescriptorHeader *)p;

dprintf("[GetDesc %d %d]", aType, aIndex);
    while (p_header->iLength)  {
dprintf("<%p %d %d>", p_header, p_header->iDescriptorType, p_header->iLength);
        if (p_header->iDescriptorType == aType)  {
            if (aIndex==0)  {
                // Found the nth descriptor of the given type
                // Are we a configuration type?
                if (aType == USB_DESCRIPTOR_CONFIGURATION)  {
                    *aLength = ((T_USBDescriptorConfiguration *)p)->iTotalLength;
                } else {
                    *aLength = p_header->iLength;
                }
dprintf("[Found %p]\n", p);
                return p;
            } else {
                // Found the right type, but wrong index.
                // Keep looking.
                aIndex--;
            }
        }
        // Next descriptor
        p += p_header->iLength;
        p_header = (T_USBDescriptorHeader *)p;
    }
dprintf("[Not Found]\n");
    // If we got here, we never found it.
    return 0;
}

/*---------------------------------------------------------------------------*
 * HAL Interface table:
 *---------------------------------------------------------------------------*/
const HAL_USBDeviceController LPC1788_USBDev_Interface = {
	{
	    "NXP:LPC1788:USB Device Controller",
	    0x0100,
	    LPC1788_USBDev_InitializeWorkspace,
	    sizeof(T_LPC1788_USBDev_Workspace),
	},
	
    LPC1788_USBDev_Configure,
    LPC1788_USBDev_Initialize,
    LPC1788_USBDev_Connect,
    LPC1788_USBDev_Disconnect,
    LPC1788_USBDev_SetAddress,
    LPC1788_USBDev_SetConfiguration,
    LPC1788_USBDev_GetConfiguration,
    LPC1788_USBDev_EndpointConfigure,
    LPC1788_USBDev_Read,
    LPC1788_USBDev_Write,
    LPC1788_USBDev_SetStallState,
    LPC1788_USBDev_IsStalled,
    LPC1788_USBDev_EndpointInterruptsEnable,
    LPC1788_USBDev_EndpointInterruptsDisable,
    LPC1788_USBDev_ForceAddressAndConfiguration,
    LPC1788_USBDev_ProcessEndpoints,
    LPC1788_USBDev_GetDescriptor,
    LPC1788_USBDev_InterruptNakEnable,
};

/*---------------------------------------------------------------------------*
 * Requirement routines:
 *---------------------------------------------------------------------------*/
void LPC1788_USBDevice_PortA_Require(
        const T_LPC1788_USBDevice_Settings *aSettings)
{
    static const T_LPC1788_IOCON_ConfigList pinsVBUS[] = {
            {GPIO_P1_30, IOCON_A_DEFAULT(2)}, // USB_VBUS
    };
    static const T_LPC1788_IOCON_ConfigList pinsDP1[] = {
            {GPIO_P0_29, IOCON_U_DEFAULT(1)}, // USB_D+1
    };
    static const T_LPC1788_IOCON_ConfigList pinsDM1[] = {
            {GPIO_P0_30, IOCON_U_DEFAULT(1)}, // USB_D-1
    };
    static const T_LPC1788_IOCON_ConfigList pinsCONNECT1[] = {
            {GPIO_P2_9,  IOCON_D_DEFAULT(1)}, // USB_CONNECT1
    };
    static const T_LPC1788_IOCON_ConfigList pinsUP_LED1[] = {
            {GPIO_P1_18, IOCON_D_DEFAULT(1)}, // USB_UP_LED1
    };

    HAL_DEVICE_REQUIRE_ONCE();
    // Register USB Device
    HALInterfaceRegister("USBDeviceController",
            (T_halInterface *)&LPC1788_USBDev_Interface, 0, 0);

