FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1788/LPC1788_USBDeviceController.c
    LPC1788_IOCON_ConfigPinOrNone(aSettings->iVBUS, pinsVBUS, ARRAY_COUNT(pinsVBUS));
    LPC1788_IOCON_ConfigPin(aSettings->iDP, pinsDP1, ARRAY_COUNT(pinsDP1));
    LPC1788_IOCON_ConfigPin(aSettings->iDM, pinsDM1, ARRAY_COUNT(pinsDM1));
    LPC1788_IOCON_ConfigPinOrNone(aSettings->iCONNECT, pinsCONNECT1,
            ARRAY_COUNT(pinsCONNECT1));
    LPC1788_IOCON_ConfigPinOrNone(aSettings->iUP_LED, pinsUP_LED1,
            ARRAY_COUNT(pinsUP_LED1));
}

void LPC1788_USBDevice_PortB_Require(
        const T_LPC1788_USBDevice_Settings *aSettings)
{
    static const T_LPC1788_IOCON_ConfigList pinsVBUS[] = {
            {GPIO_P1_30, IOCON_A_DEFAULT(2)}, // USB_VBUS
    };
    static const T_LPC1788_IOCON_ConfigList pinsDP2[] = {
            {GPIO_P0_31, IOCON_U_DEFAULT(1)}, // USB_D+2
    };
    static const T_LPC1788_IOCON_ConfigList pinsCONNECT2[] = {
            {GPIO_P0_14, IOCON_D_DEFAULT(3)}, // USB_CONNECT2
    };
    static const T_LPC1788_IOCON_ConfigList pinsUP_LED2[] = {
            {GPIO_P0_13, IOCON_A_DEFAULT(1)}, // USB_UP_LED2
    };

    HAL_DEVICE_REQUIRE_ONCE();
    // Register USB Device
    HALInterfaceRegister("USBDeviceController",
            (T_halInterface *)&LPC1788_USBDev_Interface, 0, 0);

    LPC1788_IOCON_ConfigPinOrNone(aSettings->iVBUS, pinsVBUS, ARRAY_COUNT(pinsVBUS));
    LPC1788_IOCON_ConfigPin(aSettings->iDP, pinsDP2, ARRAY_COUNT(pinsDP2));
    LPC1788_IOCON_ConfigPinOrNone(aSettings->iDM, 0, 0);
    LPC1788_IOCON_ConfigPinOrNone(aSettings->iCONNECT, pinsCONNECT2,
            ARRAY_COUNT(pinsCONNECT2));
    LPC1788_IOCON_ConfigPinOrNone(aSettings->iUP_LED, pinsUP_LED2,
            ARRAY_COUNT(pinsUP_LED2));
}

/*-------------------------------------------------------------------------*
 * End of File:  USBDev.c
 *-------------------------------------------------------------------------*/
